tap "arl/arl"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "rtk-ai/tap"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Portable Foreign Function Interface library
brew "libffi"
# Command-line interface for SQLite
brew "sqlite"
# Browser automation CLI for AI agents
brew "agent-browser"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Message bus system, providing inter-application communication
brew "dbus"
# Extended crypt library for descrypt, md5crypt, bcrypt, and others
brew "libxcrypt"
# Collection of Linux utilities
brew "util-linux"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Console Matrix
brew "cmatrix"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GNOME XML library
brew "libxml2"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Render markdown on the CLI
brew "glow"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# New file format for still image compression
brew "jpeg-xl"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Asynchronous event library
brew "libevent"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# YAML Parser
brew "libyaml"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line Git information tool
brew "onefetch"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Database of common MIME types
brew "shared-mime-info"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# OpenAI's coding agent that runs in your terminal
cask "codex"
go "cmd/go"
go "cmd/gofmt"
cargo "rtk"
